app/controllers/implements_controller.rb

  def show
    @implement = ImplementDecorator.new(Implement.find(params[:id]))
    @maintenances = Maintenance.find_limit_10
---
SELECT  `maintenances`.* FROM `maintenances`  LIMIT 10

  def create
    @implement = Implement.new(implement_params)

    if @implement.save!
---
INSERT INTO `implements` (`created_at`, `implement_type_uuid`, `name`, `note`, `photo_content_type`, `photo_file_name`, `photo_file_size`, `photo_updated_at`, `updated_at`, `uuid`, `value`) VALUES ('2014-11-20 04:52:35', '1', 'name', 'note', 'image/png', 'blue-tractor.png', 56844, '2014-11-20 04:52:33', '2014-11-20 04:52:35', '0B7B4BC0-7071-11E4-9E78-B888E33867FC', 10.0)