app/controllers/machineries_controller.rb

SELECT `tractors`.* FROM `tractors`
SELECT `implements`.* FROM `implements`
SELECT `maintenances`.* FROM `maintenances`
---
  def index
    begin
      @tractors = Tractor.all
      @implements = Implement.all
      @maintenances = MaintenanceDecorator.new(Maintenance.all)