app/controllers/maintenances_controller.rb

SELECT `labors`.* FROM `labors`
---
  def new
    begin
      @maintenance = Maintenance.new(machinery_uuid: params[:machinery_uuid],maintenance_type: params[:maintenance_type])
      @labors = Labor.all

INSERT INTO `maintenances` (`created_at`, `engine_hours`, `labor_uuid`, `machinery_uuid`, `maintenance_type`, `note`, `time_spent`, `updated_at`, `uuid`) VALUES ('2014-11-22 05:05:04', 10, '6043FC52-7156-11E4-B29C-F637B76E0101', '13AF7762-6EFA-11E4-A393-B888E33867FC', 'tractor', '', 10, '2014-11-22 05:05:04', '1ED7C398-7205-11E4-A023-B888E33867FC')
---
  def create
    begin
      @maintenance = Maintenance.new(maintenance_params)

      if @maintenance.save!