app/controllers/tractors_controller.rb

SELECT  `maintenances`.* FROM `maintenances`  LIMIT 10
---
  def show
    begin
      @tractor = TractorDecorator.new(Tractor.find(params[:id]))
      @maintenances = Maintenance.find_limit_10

INSERT INTO `tractors` (`created_at`, `fuel_capacity`, `horse_power`, `make`, `model`, `name`, `note`, `own`, `photo_content_type`, `photo_file_name`, `photo_file_size`, `photo_updated_at`, `updated_at`, `uuid`, `value`, `year`) VALUES ('2014-11-18 08:08:27', 10.0, 10.0, 'Make', 'Model', 'Tractor Name', 'NOte', 1, 'image/png', 'blue-tractor.png', 56844, '2014-11-18 08:08:27', '2014-11-18 08:08:27', '13AF7762-6EFA-11E4-A393-B888E33867FC', 10.0, '2014-10-10')
---
  def create
    begin
      @tractor = Tractor.new(tractor_params)

      if @tractor.save!

UPDATE `tractors` SET `name` = 'Tractor', `updated_at` = '2014-11-18 08:47:58' WHERE `tractors`.`uuid` = '13AF7762-6EFA-11E4-A393-B888E33867FC'
---
  def update
    begin
      @tractor = Tractor.find(params[:id])

      if @tractor.update_attributes!(tractor_params)